/****************************************Copyright (c)****************************************************
**               Copyright © 2003~2009 Shenzhen uCdragon Technology Co.,Ltd. All Rights Reserved 
**
**                                 http://www.ucdragon.cn
**
**      ÉîÛÚÊĞÓÅÁú¿Æ¼¼ÓĞÏŞ¹«Ë¾ËùÌá¹©µÄËùÓĞ·şÎñÄÚÈİÖ¼ÔÚĞ­Öú¿Í»§¼ÓËÙ²úÆ·µÄÑĞ·¢½ø¶È£¬ÔÚ·şÎñ¹ı³ÌÖĞËùÌá¹©
**  µÄÈÎºÎ³ÌĞò¡¢ÎÄµµ¡¢²âÊÔ½á¹û¡¢·½°¸¡¢Ö§³ÖµÈ×ÊÁÏºÍĞÅÏ¢£¬¶¼½ö¹©²Î¿¼£¬¿Í»§ÓĞÈ¨²»Ê¹ÓÃ»ò×ÔĞĞ²Î¿¼ĞŞ¸Ä£¬±¾¹«Ë¾²»
**  Ìá¹©ÈÎºÎµÄÍêÕûĞÔ¡¢¿É¿¿ĞÔµÈ±£Ö¤£¬ÈôÔÚ¿Í»§Ê¹ÓÃ¹ı³ÌÖĞÒòÈÎºÎÔ­ÒòÔì³ÉµÄÌØ±ğµÄ¡¢Å¼È»µÄ»ò¼ä½ÓµÄËğÊ§£¬±¾¹«Ë¾²»
**  ³Ğµ£ÈÎºÎÔğÈÎ¡£
**                                                                        ¡ªÉîÛÚÊĞÓÅÁú¿Æ¼¼ÓĞÏŞ¹«Ë¾
********************************************************************************************************/
#include "w25x32.h"

#define     SSEL_EN         (0 << 16)
#define     SSEL_DIS        (1 << 16)
#define     EOT_EN          (1 << 20)
#define     EOT_DIS         (0 << 20)
#define     EOF_EN          (1 << 21)
#define     EOF_DIS         (0 << 21)
#define     RXIGNORE_EN     (1 << 22)
#define     RXIGNORE_DIS    (0 << 22)
#define     FLEN(n)         (((n) - 1) << 24)


/*********************************************************************************************************
** º¯ÊıÃû³Æ: SendRecv_Start
** º¯Êı¹¦ÄÜ£ºÒ»´Î´«ÊäÆğÊ¼µÄµ¥×Ö½ÚÖ¡·¢ËÍÓë½ÓÊÕ
** ÊäÈë²ÎÊı: Êı¾İÏßÉÏ·¢ËÍ³öµÄÊı¾İ
** Êä³ö²ÎÊı: Êı¾İÏßÉÏ½ÓÊÕµ½µÄÊı¾İ
** ·µ »Ø Öµ£ºÎŞ
*********************************************************************************************************/
uint8_t SendRecv_Start (uint8_t ucData)
{
    while (!(LPC_SPI1->STAT & (1 << 1)));                               /* µÈ´ı·¢ËÍ×¼±¸¾ÍĞ÷             */
    LPC_SPI1->TXDATCTL = FLEN(8) | EOF_EN | SSEL_EN | ucData;           /* 8 Î»£¬´«Êä¿ªÊ¼£¬Ö¡½áÊø       */    
    
    while (!(LPC_SPI1->STAT & (1 << 0)));                               /* µÈ´ı½ÓÊÕÊı¾İÍê³É             */
    ucData = LPC_SPI1->RXDAT;                                           /* ½ÓÊÕÊı¾İ                     */
    
    return ucData;
}

/*********************************************************************************************************
** º¯ÊıÃû³Æ: SendRecv_Stop
** º¯Êı¹¦ÄÜ£ºÒ»´Î´«Êä½áÊøµÄµ¥×Ö½ÚÖ¡·¢ËÍÓë½ÓÊÕ
** ÊäÈë²ÎÊı: Êı¾İÏßÉÏ·¢ËÍ³öµÄÊı¾İ
** Êä³ö²ÎÊı: Êı¾İÏßÉÏ½ÓÊÕµ½µÄÊı¾İ
** ·µ »Ø Öµ£ºÎŞ
*********************************************************************************************************/
uint8_t SendRecv_Stop (uint8_t ucData)
{
    while (!(LPC_SPI1->STAT & (1 << 1)));                               /* µÈ´ı·¢ËÍ×¼±¸¾ÍĞ÷             */
    LPC_SPI1->TXDATCTL = FLEN(8) | EOT_EN | ucData;                     /* 8 Î»£¬´«Êä½áÊø               */    
    
    while (!(LPC_SPI1->STAT & (1 << 0)));                               /* µÈ´ı½ÓÊÕÊı¾İÍê³É             */
    ucData = LPC_SPI1->RXDAT;                                           /* ½ÓÊÕÊı¾İ                     */
    
    return ucData;
}
/*********************************************************************************************************
** º¯ÊıÃû³Æ: SendRecv_Byte
** º¯Êı¹¦ÄÜ£ºÒ»´Î´«ÊäÄÚ²¿µÄµ¥×Ö½ÚÖ¡·¢ËÍÓë½ÓÊÕ
** ÊäÈë²ÎÊı: Êı¾İÏßÉÏ·¢ËÍ³öµÄÊı¾İ
** Êä³ö²ÎÊı: Êı¾İÏßÉÏ½ÓÊÕµ½µÄÊı¾İ
** ·µ »Ø Öµ£ºÎŞ
*********************************************************************************************************/
uint8_t Send_Byte (uint8_t ucData)
{
    while (!(LPC_SPI1->STAT & (1 << 1)));                               /* µÈ´ı·¢ËÍ×¼±¸¾ÍĞ÷             */
    LPC_SPI1->TXDATCTL = FLEN(8) | EOF_EN | ucData;                     /* 8 Î»£¬Ö¡½áÊø                 */    
    
    while (!(LPC_SPI1->STAT & (1 << 0)));                               /* µÈ´ı½ÓÊÕÊı¾İÍê³É             */
    ucData = LPC_SPI1->RXDAT;                                           /* ½ÓÊÕÊı¾İ                     */
    
    return ucData;
}
/*********************************************************************************************************
** º¯ÊıÃû³Æ: flash_read_status
** º¯Êı¹¦ÄÜ: ¶ÁÈ¡Ğ¾Æ¬×´Ì¬¼Ä´æÆ÷µÄÖµ
** ÊäÈë²ÎÊı: ÎŞ
** Êä³ö²ÎÊı: ×´Ì¬¼Ä´æÆ÷µÄÖµ
** ·µ »Ø Öµ: ×´Ì¬¼Ä´æÆ÷µÄÖµ
*********************************************************************************************************/
uint8_t flash_read_status ( void )
{
	uint8_t status;

	SendRecv_Start(0x05);					        
	status = SendRecv_Stop(0xff);				        
	return status;											    /*·µ»Ø¼Ä´æÆ÷ Reg 1's Öµ		*/
}

/*********************************************************************************************************
** º¯ÊıÃû³Æ: flash_write_enable
** º¯Êı¹¦ÄÜ: Ğ¾Æ¬µÄ¶ÁÊ¹ÄÜ
** ÊäÈë²ÎÊı: ÎŞ
** Êä³ö²ÎÊı: ÎŞ
** ·µ »Ø Öµ: ÎŞ
*********************************************************************************************************/
static void flash_write_enable (void)
{
	while (flash_read_status() & 0x01 != 0x00);                         /* µÈ´ıĞ¾Æ¬¿ÕÏĞ         */
	SendRecv_Stop(0x06);	
	while (flash_read_status() & 0x03 != 0x02);                         /* µÈ´ı²Ù×÷Íê³É  */
}

/*********************************************************************************************************
** º¯ÊıÃû³Æ: flash_read_id
** º¯Êı¹¦ÄÜ: ¶ÁÈ¡Ğ¾Æ¬µÄIDºÅ
** ÊäÈë²ÎÊı: IDType ¶ÁÈ¡IDÀàĞÍ£ºManu_ID,Dev_ID,Jedec_ID
** Êä³ö²ÎÊı: IDcode Ğ¾Æ¬ID
** ·µ »Ø Öµ: IDcode Ğ¾Æ¬ID
*********************************************************************************************************/
uint32_t flash_read_id (uint8_t IDType)
{
	uint32_t IDcode,temp;

	if (IDType == Jedec_ID) {
		SendRecv_Start(0x9F);                                       /* ¿ªÊ¼£º·¢ËÍ¶ÁIDÃüÁî(9Fh)      */
		temp = (temp | Send_Byte(0xFF)) << 8;                       /* ½ÓÊÕÊı¾İµÚ 1 ¸ö×Ö½Ú          */
		temp = (temp | Send_Byte(0xFF)) << 8;                       /* ½ÓÊÕÊı¾İµÚ 2 ¸ö×Ö½Ú          */
		temp = (temp | SendRecv_Stop(0xFF));                        /* ½ÓÊÕÊı¾İµÚ 3 ¸ö×Ö½Ú£º½áÊø    */
		IDcode = temp;
		return (IDcode);
	}else{
	SendRecv_Start(0x90);
	Send_Byte(0x00);
	Send_Byte(0x00);
	Send_Byte(0x00);
  IDcode = (Send_Byte(0xff) << 8) | SendRecv_Stop(0xff);
	return IDcode; 	
	}		
}

/*********************************************************************************************************
** º¯ÊıÃû³Æ: flash_read_data
** º¯Êı¹¦ÄÜ: ¶ÁÈ¡Ğ¾Æ¬µÄÊı¾İ
** ÊäÈë²ÎÊı: RAddr    -- ¿ªÊ¼¶ÁÈ¡µÄµØÖ·
** Êä³ö²ÎÊı: buf      -- ´æ·Å¶Áµ½µÄÊı¾İ»º´æ
             RLength  -- ¶ÁÈ¡Êı¾İµÄ³¤¶È
** ·µ »Ø Öµ: ²Ù×÷½á¹û 1--³É¹¦£¬0--Ê§°Ü
*********************************************************************************************************/
uint8_t flash_read_data (uint32_t RAddr, uint8_t *buf, uint32_t RLength)
{
	uint8_t Temp;
	uint32_t i;

	if (RLength == 0)
	{
		return 0;
	}

	/*
	 *	Check the state register. If it's busy , wait until it's free
	 */
	while(1)														
	{														
		Temp = flash_read_status( );								
		Temp &= 0x01;											
		if(Temp == 0x00)									
			break;									
		for(i=0; i<10; i++);						
	}

	SendRecv_Start(0x03);                                   /* ¿ªÊ¼£º·¢ËÍ¶ÁÃüÁî(03h)        */
	Send_Byte((RAddr & 0xFF0000) >> 16);                    /* ·¢ËÍµØÖ·ĞÅÏ¢:¸ÃµØÖ·Îª3¸ö×Ö½Ú */
	Send_Byte((RAddr & 0x00FF00) >> 8);                    
	Send_Byte((RAddr & 0x0000FF));
	for (i=0; i<RLength; i++)
	{
		if(i==(RLength-1))                                     /* ÅĞ¶Ï¶ÁÈ¡µÄÊÇ²»ÊÇ×îºóÒ»¸ö×Ö½Ú*/
			buf[i] = SendRecv_Stop(0xff);                        /* ÊÇµÄ»°½áÊø±¾´Î¶ÁÈ¡*/
		else                                                   /* ²»ÊÇÊÇµÄ»°¼ÌĞø¶ÁÈ¡*/
			buf[i] = Send_Byte(0xff);
	}									
	return 1;
}


/*********************************************************************************************************
** º¯ÊıÃû³Æ: flash_write_sector
** º¯Êı¹¦ÄÜ: ÔÚÒ»¸öÉÈÇøÖĞĞ´ÈëÖ¸¶¨³¤¶ÈµÄÊı¾İ
** ÊäÈë²ÎÊı: RAddr   -- ¿ªÊ¼Ğ´ÈëµÄµØÖ·
** Êä³ö²ÎÊı: buf     -- ÒªĞ´ÈëµÄÊı¾İ»º´æ
             RLength -- Ğ´ÈëÊı¾İµÄ³¤¶È 0-4095
** ·µ »Ø Öµ: ²Ù×÷½á¹û 1--³É¹¦£¬0--Ê§°Ü
*********************************************************************************************************/
uint8_t flash_write_sector (uint32_t WAddr, uint8_t *buf, uint32_t WLength)
{
	uint32_t i;

	if (WLength == 0)
	{
		return 0;
	}

	flash_write_enable();												         /* Ğ´Ê¹ÄÜ */

	SendRecv_Start(0x02);                                /* ¿ªÊ¼£º·¢ËÍĞ´ÃüÁî(02h)     */
	Send_Byte((WAddr & 0xFF0000) >> 16);
	Send_Byte((WAddr & 0x00FF00) >> 8);
	Send_Byte((WAddr & 0x0000FF));
	for (i=0; i<WLength; i++)
	{
		if(i==(WLength-1))                                 /* ÅĞ¶ÏĞ´ÈëµÄÊÇ²»ÊÇ×îºóÒ»¸ö×Ö½Ú*/
		SendRecv_Stop(buf[i]);                             /* ÊÇµÄ»°½áÊø±¾´ÎĞ´Èë*/
		else
		Send_Byte(buf[i]);                                 /* ²»ÊÇÊÇµÄ»°¼ÌĞøĞ´Èë*/
	}
	while (flash_read_status() & 0x01 != 0x00);

	return 1;
}

/*********************************************************************************************************
** º¯ÊıÃû³Æ: flash_write_data
** º¯Êı¹¦ÄÜ: Ğ´ÈëÖ¸¶¨³¤¶ÈµÄÊı¾İ£¬²»ÏŞÓÚÒ»¸öÉÈÇø
** ÊäÈë²ÎÊı: RAddr   -- ¿ªÊ¼Ğ´ÈëµÄµØÖ·
** Êä³ö²ÎÊı: buf     -- ÒªĞ´ÈëµÄÊı¾İ»º´æ
             RLength -- Ğ´ÈëÊı¾İµÄ³¤¶È 0-
** ·µ »Ø Öµ: ²Ù×÷½á¹û 1--³É¹¦£¬0--Ê§°Ü

*********************************************************************************************************/							
uint8_t flash_write_data (uint32_t WAddr, uint8_t *buf, uint32_t WLength)
{
	uint32_t dealer, remainder;
	uint32_t i, addr, len = 0;

	if (WLength == 0)
	{
		return 0;
	}

	remainder = WAddr % W25X32_PAGE_SIZE;

	/*
	 * Write the data not enough to one page memory
	 */
	if (remainder != 0)
	{
		len = W25X32_PAGE_SIZE - remainder;
		if (len < WLength)
		{
			flash_write_sector(WAddr, buf, len);
		} else
		{
			flash_write_sector(WAddr, buf, WLength);
			return 1;
		}
	}
	
	/*
	 * Calculate the rest data, then write several packets with whole page memory
	 */
	remainder = (WLength - len) % W25X32_PAGE_SIZE;
	dealer    = (WLength - len) / W25X32_PAGE_SIZE;
	for (i=0; i<dealer; i++)
	{
		addr = len + (i * W25X32_PAGE_SIZE);
		flash_write_sector(WAddr+addr, (uint8_t *)&buf[addr], W25X32_PAGE_SIZE);
	}
	
	/*
	 * Write the last data that not enough to one page memory
	 */
	if (remainder != 0)
	{
		addr = len + (i * W25X32_PAGE_SIZE);
		flash_write_sector(WAddr+addr, (uint8_t *)&buf[addr], remainder);
	}												
	
	return 1;
}


/*********************************************************************************************************
** º¯ÊıÃû³Æ: flash_whole_erase
** º¯Êı¹¦ÄÜ: ²Á³ıÕû¸öĞ¾Æ¬µÄÊı¾İ
** ÊäÈë²ÎÊı: ÎŞ
** Êä³ö²ÎÊı: ÎŞ
** ·µ »Ø Öµ: ²Ù×÷½á¹û 1--³É¹¦£¬0--Ê§°Ü
*********************************************************************************************************/
uint8_t flash_whole_erase( void )
{
	flash_write_enable();												    /* Write enable                 */
	
	SendRecv_Stop(0x60);
	while (flash_read_status() & 0x01 != 0x00);	                        /* Wait for the flash free      */
    
	return 1;
}

/*********************************************************************************************************
** º¯ÊıÃû³Æ: flash_block_erase
** º¯Êı¹¦ÄÜ: Ê¹ÓÃ¿é²Á³ıĞ¾Æ¬ÉÏµÄÊı¾İ
** ÊäÈë²ÎÊı: addr ¿ªÊ¼²Á³ıµÄµØÖ·
** Êä³ö²ÎÊı: ÎŞ
** ·µ »Ø Öµ: ²Ù×÷½á¹û 1--³É¹¦£¬0--Ê§°Ü
*********************************************************************************************************/
uint8_t flash_block_erase (uint32_t addr)
{
	flash_write_enable();												    /* Write enable                 */
	
	SendRecv_Start(0xD8);
	Send_Byte((addr & 0xFF0000) >> 16);
	Send_Byte((addr & 0x00FF00) >> 8);
	SendRecv_Stop(addr & 0x0000FF);
	
	while (flash_read_status() & 0x01 != 0x00);					        /* Wait for the flash free      */
    
	return 1;
}

/*********************************************************************************************************
** º¯ÊıÃû³Æ: flash_sector_erase
** º¯Êı¹¦ÄÜ: Ê¹ÓÃÉÈÇø²Á³ıĞ¾Æ¬ÉÏµÄÊı¾İ
** ÊäÈë²ÎÊı: addr ¿ªÊ¼²Á³ıµÄµØÖ·
** Êä³ö²ÎÊı: ÎŞ
** ·µ »Ø Öµ: ²Ù×÷½á¹û 1--³É¹¦£¬0--Ê§°Ü
*********************************************************************************************************/
uint8_t flash_sector_erase (uint32_t addr)
{
	flash_write_enable();												    /* Write enable                 */
	
	SendRecv_Start(0x20);
	Send_Byte((addr & 0xFF0000) >> 16);
	Send_Byte((addr & 0x00FF00) >> 8);
	SendRecv_Stop(addr & 0x0000FF);
	
	while (flash_read_status() & 0x01 != 0x00);							/* Wait for the flash free      */
    
	return 1;
}


/*********************************************************************************************************
** º¯ÊıÃû³Æ: flash_sel_erases
** º¯Êı¹¦ÄÜ: Í¬Ê±²Á³ıĞ¾Æ¬ÉÏ¶à¸öÉÈÇøµÄÊı¾İ
** ÊäÈë²ÎÊı: startSec  --¿ªÊ¼²Á³ıµÄÉÈÇø
** Êä³ö²ÎÊı: endSec    --½áÊø²Á³ıµÄÉÈÇø
** ·µ »Ø Öµ: ²Ù×÷½á¹û 1--³É¹¦£¬0--Ê§°Ü
*********************************************************************************************************/
uint8_t flash_sel_erases (uint32_t startSec, uint32_t endSec)
{
	uint32_t i;

	for (i=startSec; i<=endSec; i++)
	{
		flash_sector_erase(i * W25X32_SECTOR_SIZE);
	}

	return(1);
}

/*********************************************************************************************************
  End Of File
*********************************************************************************************************/













